# Operations

In [1]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## 1. unique() 
Returns a list of `unique` values

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

## 2. nunique() 
Returns the number of `unique` values

In [4]:
df['col2'].nunique()

3

## 3. value_counts() 
Returns `unique` values and number of times it is `repeated`

In [5]:
3df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

## Selecting Data

In [6]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [7]:
df[(df['col1']>2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

## Applying Functions
We can apply our own `custom` functions, using `apply()` method.

In [8]:
def times2(x):
    return x*2

In [9]:
df['col1'].apply(times2) # the apply() method will apply the passed function to all the rows of particular column.

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

### Appying a built-in function

In [10]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [11]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

## apply() method with lambda function

In [12]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

## `df.columns` and `df.index` attributes

In [14]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=4, step=1)

## sort_values() method
Used to sort the table by `columns` or `rows` (default is row)

In [16]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## df.isnull() method
returns a boolean DataFrames.

In [17]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [18]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

# pivot_table() method
it is used to create multi level index

In [19]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [20]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN